{
  "articles": [
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE I: The Shari’a Courts",
      "chapter": "CHAPTER II: Shari’a Circuit Courts",
      "section": "",
      "article_number": 150,
      "text": "Where established. – (1) Shari’a Circuit Courts shall be established as follows: (a) Six such courts in the Province of Sulu; (b) Eight in the Province of Tawi-Tawi; (c) Ten in and for the Provinces of Basilan, Zamboanga del Norte and Zamboanga del Sur, and the Cities of Dipolog, Pagadian, and Zamboanga; (d) Twelve in and for the Provinces of Lanao del Norte and Lanao del Sur and the Cities of Iligan and Marawi; (e) Fifteen in and for the Province of Maguindanao, North Cotabato and Sultan Kudarat and the City of Cotabato. (2) The territorial jurisdiction of each of the Shari’a Circuit Courts shall be fixed by the Supreme Court on the basis of geographical contiguity of the municipalities and cities concerned and their Muslim population."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE I: The Shari’a Courts",
      "chapter": "CHAPTER II: Shari’a Circuit Courts",
      "section": "",
      "article_number": 151,
      "text": "Appointment of judges. – Each Shari’a Circuit Court shall be presided over by a Shari’a Circuit Judge to be appointed by the President of the Philippines."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE I: The Shari’a Courts",
      "chapter": "CHAPTER II: Shari’a Circuit Courts",
      "section": "",
      "article_number": 152,
      "text": "Qualifications. – No person shall be appointed judge of the Shari’a Circuit Court unless he is a natural-born citizen of the Philippines, at least twenty-five years of age, and has passed an examination in the Shari’a and Islamic jurisprudence (fiqh) to be given by the Supreme Court for admission to special membership in the Philippine Bar to practice in the Shari’a Courts."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE I: The Shari’a Courts",
      "chapter": "CHAPTER II: Shari’a Circuit Courts",
      "section": "",
      "article_number": 153,
      "text": "Tenure. – Shari’a Circuit judges shall be appointed to serve during good behavior until they reach the age of sixty-five years or become incapacitated to discharge the duties of their office, unless sooner removed for the same causes and in the same manner provided by law for judges of Municipal Circuit Courts."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE I: The Shari’a Courts",
      "chapter": "CHAPTER II: Shari’a Circuit Courts",
      "section": "",
      "article_number": 154,
      "text": "Compensation. – Shari’a Circuit judges shall receive the same compensation and enjoy the same privileges as judges of Municipal Circuit Courts."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE I: The Shari’a Courts",
      "chapter": "CHAPTER II: Shari’a Circuit Courts",
      "section": "",
      "article_number": 155,
      "text": "Jurisdiction. – The Shari’a Circuit Courts shall have exclusive original jurisdiction over: (1) All cases involving offenses defined and punished under this Code. (2) All civil actions and proceedings between parties who are Muslims or have been married in accordance with Article 13 involving disputes relating to: (a) Marriage; (b) Divorce recognized under this Code; (c) Betrothal or breach of contract to marry; (d) Customary dower (mahr); (e) Disposition and distribution of property upon divorce; (f) Maintenance and support, and consolatory gifts, (mut’a); and (g) Restitution of marital rights. (3) All cases involving disputes relative to communal properties."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE I: The Shari’a Courts",
      "chapter": "CHAPTER II: Shari’a Circuit Courts",
      "section": "",
      "article_number": 156,
      "text": "Clerks and other subordinate employees. – (1) Shari’a Circuit Courts shall have the same officers and other personnel as those provided by law for Municipal Circuit Courts. (2) The pertinent provisions of the Judiciary Law regarding the number, qualifications, appointment, compensation, functions, duties and other matters relative to the personnel of the Municipal Circuit Courts shall apply to those of the Shari’a Circuit Courts."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE I: The Shari’a Courts",
      "chapter": "CHAPTER II: Shari’a Circuit Courts",
      "section": "",
      "article_number": 157,
      "text": "Place of sessions; stations. – Shari’a Circuit Court may hold session anywhere within their respective circuits, but each shall have a principal station to be fixed by the Supreme Court."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE I: The Shari’a Courts",
      "chapter": "CHAPTER II: Shari’a Circuit Courts",
      "section": "",
      "article_number": 158,
      "text": "Special procedure. – The Shari’a Circuit Courts shall be governed by such special rules of procedure as the Supreme Court may promulgate."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE I: The Shari’a Courts",
      "chapter": "CHAPTER II: Shari’a Circuit Courts",
      "section": "",
      "article_number": 159,
      "text": "Applicability of other laws. – The provisions of all laws relative to Municipal Circuit Courts shall, to the extent that they are not inconsistent with this Code, be applicable to the Shari’a Circuit Courts."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE II: The Agama Arbitration Council",
      "chapter": "",
      "section": "",
      "article_number": 160,
      "text": "Constitution. – The Shari’a District Court or the Shari’a Circuit Court may, in appropriate cases, constitute an Agama Arbitration Council in the manner specified in this Title."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE II: The Agama Arbitration Council",
      "chapter": "",
      "section": "",
      "article_number": 161,
      "text": "Divorce by talaq and tafwid. – (1) Any Muslim male who has pronounced a talaq shall, without delay, file with the Clerk of Court of the Shari’a Circuit Court of the place where his family resides a written notice of such fact and the circumstances attended thereto, after having served a copy thereof to the wife concerned. The talaq pronounced shall not become irrevocable until after the expiration of the prescribed ‘idda. The notice filed shall be conclusive evidence that talaq has been pronounced. (2) Within seven days from receipt of notice, the Clerk of Court shall require each of the parties to nominate a representative. The representatives shall be appointed by the Court to constitute, together with the Clerk of Court as Chairman, an Agama Arbitration Council. The Agama Arbitration Council shall submit to the Court a report on the result of the arbitration, on the basis of which and such other evidence as may be allowed, the Court shall issue the corresponding order. (3) The provisions of this article shall be observed should the wife exercise tafwid."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE II: The Agama Arbitration Council",
      "chapter": "",
      "section": "",
      "article_number": 162,
      "text": "Subsequent marriages. – Any Muslim husband desiring to contract a subsequent marriage shall, before so doing, file a written notice thereof with the Clerk of Court of the Shari’a Circuit Court of the place where his family resides. Upon receipt of said notice, the Clerk shall serve a copy thereof to the wife or wives. Should any of them object, an Agama Arbitration Council shall be constituted in accordance with the provisions of paragraph (2) of the preceding article. If the Agama Arbitration Council fails to obtain the wife’s consent to the proposed marriage, the Court shall, subject to Article 27, decide whether or not to sustain her objection."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE II: The Agama Arbitration Council",
      "chapter": "",
      "section": "",
      "article_number": 163,
      "text": "Offenses against customary law. – The Shari’a Circuit Court, in cases involving offenses against customary law which can be settled without formal trial, may, at its discretion, direct the Shari’a Clerk of Court to constitute a council of not less than two nor more than four members, with him as chairman, to settle the case amicably."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE III: Jurisconsult in Islamic Law",
      "chapter": "",
      "section": "",
      "article_number": 164,
      "text": "Creation of office and appointment. – (1) There shall be a Jurisconsult in Islamic law, who shall be appointed by the President of the Philippines and hold office for a term of seven years, without prejudice to re-appointment, unless sooner removed for cause or incapacitated to discharge the duties of his office. (2) The Office of the Jurisconsult shall be under the administrative supervision of the Supreme Court of the Philippines which shall also fix its permanent station, preferably in the City of Zamboanga."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE III: Jurisconsult in Islamic Law",
      "chapter": "",
      "section": "",
      "article_number": 165,
      "text": "Qualifications. – No person shall be appointed Jurisconsult in Islamic Law unless he is a citizen of the Philippines, at least forty years of age, of good moral character and proven integrity, and an eminent scholar in the Qur’an and Hadith and in Islamic jurisprudence as well as proficient in Arabic."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE III: Jurisconsult in Islamic Law",
      "chapter": "",
      "section": "",
      "article_number": 166,
      "text": "Functions. – (1) The Jurisconsult shall, on the written request of any interested party, have the authority to render legal opinions, based on recognized authorities, regarding any question relating to Muslim Law. For this purpose, he may, if he deems it necessary, consult or ask for a consensus of the ‘ulama. (2) The Jurisconsult shall consider and act on every such request unless, in his opinion and for good reason, the question need not be answered. (3) The Office of the Jurisconsult shall keep a compilation and cause the publication of all his legal opinions."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE III: Jurisconsult in Islamic Law",
      "chapter": "",
      "section": "",
      "article_number": 167,
      "text": "Compensation. – Until otherwise provided by law, the Jurisconsult shall receive an annual compensation of forty-eight thousand pesos which shall not be diminished during his term of office."
    },
    {
      "book": "BOOK FOUR: Adjudication and Settlement of Disputes and Rendition of Legal Opinions",
      "title": "TITLE III: Jurisconsult in Islamic Law",
      "chapter": "",
      "section": "",
      "article_number": 168,
      "text": "Office personnel. – The Jurisconsult may, in accordance with the Civil Service Law and subject to the approval of the Supreme Court, appoint and fix the compensation of such personnel as may be necessary for the performance of his functions."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE I: Muslim Holidays",
      "chapter": "",
      "section": "",
      "article_number": 169,
      "text": "Official Muslim holidays. – The following are hereby recognized as legal Muslim holidays: (a) ‘Amun Jadid (New Year), which falls on the first day of the first lunar month of Muharram; (b) Maulid-un-Nabi (Birthday of the Prophet Muhammad), which falls on the twelfth day of the third lunar month of Rabi-ul-Awwal; (c) Lailatul Isra Wal Mi’raj (Nocturnal Journey and Ascension of the Prophet Muhammad), which falls on the twenty-seventh day of the seventh lunar month of Rajab; (d) ‘Id-ul-Fitr (Hari Raya Pausa), which falls on the first day of the tenth lunar month of Shawwal, commemorating the end of the fasting season; and (e) ‘Id-ul-Adha (Hari Raya Haji), which falls on the tenth day of the twelfth lunar month of Dhu 1-Hijja."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE I: Muslim Holidays",
      "chapter": "",
      "section": "",
      "article_number": 170,
      "text": "Provinces and cities where officially observed. – (1) Muslim holidays shall be officially observed in the Provinces of Basilan, Lanao del Norte, Lanao del Sur, Maguindanao, North Cotabato, Sultan Kudarat, Sulu, Tawi-Tawi, Zamboanga del Norte and Zamboanga del Sur, and in the Cities of Cotabato, Iligan, Marawi, Pagadian, and Zamboanga and in such other Muslim provinces and cities as may hereafter be created. (2) Upon proclamation by the President of the Philippines, Muslim holidays may also be officially observed in other provinces and cities."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE I: Muslim Holidays",
      "chapter": "",
      "section": "",
      "article_number": 171,
      "text": "Dates of observance. – The dates of Muslim holidays shall be determined by the Office of the President of the Philippines in accordance with the Muslim Lunar Calendar (Hijra)."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE I: Muslim Holidays",
      "chapter": "",
      "section": "",
      "article_number": 172,
      "text": "Observance by Muslim employees. – (1) All Muslim government officials and employees in places other than those enumerated under Article 170 shall also be excused from reporting to office in order that they may be able to observe Muslim holidays. (2) The President of the Philippines may, by proclamation, require private offices, agencies or establishments to excuse their Muslim employees from reporting for work during a Muslim holiday without reduction in their usual compensation."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE II: Communal Property",
      "chapter": "",
      "section": "",
      "article_number": 173,
      "text": "What constitute. – The following are communal properties: (a) Customary heirloom, which shall include artifacts and ancestral implements or things of cultural value handed down from a common ancestor; (b) Ancestral property, which shall comprehend hallowed ancestral plot, ancestral shrine, royal court, and similar properties; and (c) charitable trust property."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE II: Communal Property",
      "chapter": "",
      "section": "",
      "article_number": 174,
      "text": "Administration or disposition. – (1) Except as otherwise provided in this Code, communal property shall be administered or disposed of in accordance with Muslim law, ‘ada, and special provisions of law. (2) Any provision of existing law to the contrary notwithstanding, the trustee of any communal property shall be the person who is in lawful possession thereof, either personally or through an agent. (3) The Shari’a Circuit Court may appoint a trustee of a communal property when there is a dispute as to its custody, possession, or administration."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE III: Customary Contracts",
      "chapter": "",
      "section": "",
      "article_number": 175,
      "text": "How construed. – Any transaction whereby one person delivers to another any real estate, plantation, orchard or any fruit-bearing property by virtue of sanda, sanla, arindao, or similar customary contract, shall be construed as a mortgage (rihan) in accordance with Muslim law."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE IV: Conversions",
      "chapter": "",
      "section": "",
      "article_number": 176,
      "text": "Effect of registration of conversion to Islam. – (1) Registration of a person’s conversion to Islam shall constitute a prima facie proof that he professes Islam. (2) Whoever disputes the profession or renunciation of Islam by any person shall have the burden of proving the contrary."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE IV: Conversions",
      "chapter": "",
      "section": "",
      "article_number": 177,
      "text": "Regulation on conversion. – No conversion of a minor below the age of eighteen years shall be registered by the District or Circuit Registrar without the written consent or permission of the parents or guardian, except when such minor has been emancipated from parental authority in accordance with law."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE IV: Conversions",
      "chapter": "",
      "section": "",
      "article_number": 178,
      "text": "Effect of conversion to Islam on marriage. – The conversion of non-Muslim spouses to Islam shall have the legal effect of ratifying their marriage as if the same had been performed in accordance with the provisions of this Code or Muslim law, provided that there is no legal impediment to the marriage under Muslim law."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE IV: Conversions",
      "chapter": "",
      "section": "",
      "article_number": 179,
      "text": "Effect of change of religion. – The change of religion by a Muslim shall not have the effect of extinguishing any obligation or liability whatsoever incurred prior to said change."
    }
  ]
}