{
  "articles": [
    {
      "book": "BOOK ONE: General Provisions",
      "title": "TITLE I: Title and Purposes of Code",
      "chapter": "",
      "section": "",
      "article_number": 1,
      "text": "Title. – This decree shall be known as the “Code of Muslim Personal Laws of the Philippines.”"
    },
    {
      "book": "BOOK ONE: General Provisions",
      "title": "TITLE I: Title and Purposes of Code",
      "chapter": "",
      "section": "",
      "article_number": 2,
      "text": "Purpose of Code. – Pursuant to Section 11 of Article XV of the Constitution of the Philippines, which provides that “The State shall consider the customs, traditions, beliefs and interests of national cultural communities in the formulation and implementation of state policies,” this Code: (a) Recognizes the legal system of the Muslims in the Philippines as part of the law of the land and seeks to make Islamic institutions more effective; (b) Codifies Muslim personal laws; and (c) Provides for an effective administration and enforcement of Muslim personal laws among Muslims."
    },
    {
      "book": "BOOK ONE: General Provisions",
      "title": "TITLE II: Construction of Code and Definition of Terms",
      "chapter": "",
      "section": "",
      "article_number": 3,
      "text": "Conflict of provisions. – (1) In case of conflict between any provision of this Code and laws of general application, the former shall prevail. (2) Should the conflict be between any provision of this Code and special laws or laws of local application, the latter shall be liberally construed in order to carry out the former. (3) The provisions of this Code shall be applicable only to Muslims and nothing herein shall be construed to operate to the prejudice of a non-Muslim."
    },
    {
      "book": "BOOK ONE: General Provisions",
      "title": "TITLE II: Construction of Code and Definition of Terms",
      "chapter": "",
      "section": "",
      "article_number": 4,
      "text": "Construction and interpretation. – (1) In the construction and interpretation of this Code and other Muslim laws, the court shall take into consideration the primary sources of Muslim law. (2) Standard treatises and works on Muslim law and jurisprudence shall be given persuasive weight in the interpretation of Muslim law."
    },
    {
      "book": "BOOK ONE: General Provisions",
      "title": "TITLE II: Construction of Code and Definition of Terms",
      "chapter": "",
      "section": "",
      "article_number": 5,
      "text": "Proof of Muslim law and ‘äda. – Muslim law and ‘äda not embodied in this Code shall be proven in evidence as a fact. No ‘äda which is contrary to the Constitution of the Philippines, this Code, Muslim law, public order, public policy or public interest shall be given any legal effect."
    },
    {
      "book": "BOOK ONE: General Provisions",
      "title": "TITLE II: Construction of Code and Definition of Terms",
      "chapter": "",
      "section": "",
      "article_number": 6,
      "text": "Conflict in Islamic schools of law. – (1) Should there be any conflict among the orthodox (Sunni) Muslim schools of law (Madhähib), that which is in consonance with the Constitution of the Philippines, this Code, public order, public policy and public interest shall be given effect. (2) The Muslim schools of law shall, for purposes of this Code, be the Hanfi, the Hanbali, the Maliki and the Shafi’i."
    },
    {
      "book": "BOOK ONE: General Provisions",
      "title": "TITLE II: Construction of Code and Definition of Terms",
      "chapter": "",
      "section": "",
      "article_number": 7,
      "text": "Definition of terms. – Unless the context otherwise provides: (a) “Agama Arbitration Council” means a body composed of the Chairman and a representative of each of the parties to constitute a council to take all necessary steps for resolving conflicts between them. (b) “Ada” means customary law. (c) “General Register” means the General Register of marriages, divorces, revocation of divorces, conversion and such other deeds or instruments kept by the Registrar under this Code. (d) “Ihram” signifies the state of ritual consecration of a person while on pilgrimage to Mecca. (e) “Madhhab” (plural, Madhähib) means any of the four orthodox (Sunni) schools of Muslim law. (f) “Month” means a period of thirty days. (g) “Muslim” is a person who testifies to the oneness of God and the Prophethood of Muhammad and professes Islam. (h) “Muslim Law” (Shari’a) refers to all the ordinances and regulations governing Muslims as found principally in the Qur’an and the Hadith. (i) “Muslim Personal Law” includes all laws relating to personal status, marriage and divorce, matrimonial and family relations, succession and inheritance, and property relations between spouses as provided for in this Code."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE I: Civil Personality (Shakhsiyah Madaniya)",
      "chapter": "",
      "section": "",
      "article_number": 8,
      "text": "Legal capacity. – Juridical capacity, which is the fitness to be the subject of legal relations, is inherent in every natural person and is lost only through death. Capacity to act, which is the power to do acts with legal effect, is acquired and may be lost."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE I: Civil Personality (Shakhsiyah Madaniya)",
      "chapter": "",
      "section": "",
      "article_number": 9,
      "text": "Restrictions on capacity. – The following circumstances, among others, modify or limit capacity to act: age, insanity, imbecility, the state of being deaf-mute, the condition of death-illness (marad-ul-maut), penalty, prodigality, absence, family relations, alienage, insolvency, and trusteeship. The consequences of these circumstances are governed by this Code and other Islamic laws and, in a suppletory manner, by other laws."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE I: Civil Personality (Shakhsiyah Madaniya)",
      "chapter": "",
      "section": "",
      "article_number": 10,
      "text": "Personality, how acquired. – Birth determines personality; but the conceived child shall be considered born for all purposes that are favorable to it, provided it be born alive, however, briefly, at the time it is completely delivered from the mother’s womb."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE I: Civil Personality (Shakhsiyah Madaniya)",
      "chapter": "",
      "section": "",
      "article_number": 11,
      "text": "Extinction of personality. – (1) Civil personality is extinguished by death. The effect of death upon the rights and obligations of a deceased person is determined by this Code, by contract, and by will. (2) After an absence of seven years, it being unknown whether or not the absentee still lives, he shall be presumed dead."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE I: Civil Personality (Shakhsiyah Madaniya)",
      "chapter": "",
      "section": "",
      "article_number": 12,
      "text": "Simultaneous death. – If, as between two or more persons who are called to succeed each other, there is a doubt as to which of them died first, whoever alleges the death of one prior to the other shall prove the same; in the absence of such proof, it is presumed that they died at the same time and there shall be no transmission of rights from one to the other. However, the successional rights of their respective heirs shall not be affected."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE II: Marriage and Divorce",
      "chapter": "CHAPTER I: Applicability Clause",
      "section": "",
      "article_number": 13,
      "text": "Application. – (1) The provisions of this Title shall apply to marriage and divorce wherein both parties are Muslims, or wherein only the male party is a Muslim and the marriage is solemnized in accordance with Muslim law or this Code in any part of the Philippines. (2) In case of marriage between a Muslim and a non-Muslim, solemnized not in accordance with Muslim law or this Code, the Civil Code of the Philippines shall apply. (3) Subject to the provisions of the preceding paragraphs, the essential requisites and legal impediments to marriage, divorce, paternity and filiation, guardianship and custody of minors, support and maintenance, claims for customary dower (mahr), betrothal, breach of contract to marry, solemnization and registration of marriage and divorce, rights and obligations between husband and wife, parental authority, and the property relations between husband and wife shall be governed by this Code and other applicable Muslim laws."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE II: Marriage and Divorce",
      "chapter": "CHAPTER II: Marriage (Nikah)",
      "section": "SECTION 1. Requisites of Marriage. –",
      "article_number": 14,
      "text": "Nature. – Marriage is not only a civil contract but a social institution. Its nature, consequences and incidents are governed by this Code and the Shari’a and not subject to stipulation, except that the marriage settlements may to a certain extent fix the property relations of the spouses."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE II: Marriage and Divorce",
      "chapter": "CHAPTER II: Marriage (Nikah)",
      "section": "SECTION 1. Requisites of Marriage. –",
      "article_number": 15,
      "text": "Essential requisites. – No marriage contract shall be perfected unless the following essential requisites are complied with: (a) Legal capacity of the contracting parties; (b) Mutual consent of the parties freely given; (c) Offer (ijab) and acceptance (qabul) duly witnessed by at least two competent persons after the proper guardian in marriage (wali) has given his consent; and (d) Stipulation of customary dower (mahr) duly witnessed by two competent persons."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE II: Marriage and Divorce",
      "chapter": "CHAPTER II: Marriage (Nikah)",
      "section": "SECTION 1. Requisites of Marriage. –",
      "article_number": 16,
      "text": "Capacity to contract marriage. – (1) Any Muslim male at least fifteen years of age and any Muslim female of the age of puberty or upwards and not suffering from any impediment under the provisions of this Code may contract marriage. A female is presumed to have attained puberty upon reaching the age of fifteen. (2) However, the Shari’a District Court may, upon petition of a proper wali, order the solemnization of the marriage of a female who though less than fifteen but not below twelve years of age, has attained puberty. (3) Marriage through a wali by a minor below the prescribed ages shall be regarded as betrothal and may be annulled upon the petition of either party within four years after attaining the age of puberty, provided no voluntary cohabitation has taken place and the wali who contracted the marriage was other than the father or paternal grandfather."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE II: Marriage and Divorce",
      "chapter": "CHAPTER II: Marriage (Nikah)",
      "section": "SECTION 1. Requisites of Marriage. –",
      "article_number": 17,
      "text": "Marriage ceremony. – No particular form of marriage ceremony is required but the ijab and the gabul in marriage shall be declared publicly in the presence of the person solemnizing the marriage and two competent witnesses. This declaration shall be set forth in an instrument in triplicate, signed or marked by the contracting parties and said witnesses, and attested by the person solemnizing the marriage. One copy shall be given to the contracting parties and another sent to the Circuit Registrar by the solemnizing officer who shall keep the third.  casia"
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE II: Marriage and Divorce",
      "chapter": "CHAPTER II: Marriage (Nikah)",
      "section": "SECTION 1. Requisites of Marriage. –",
      "article_number": 18,
      "text": "Authority to solemnize marriage. – Marriage may be solemnized: (a) By the proper wali of the woman to be wedded; (b) Upon authority of the proper wali, by any person who is competent under Muslim law to solemnize marriage; or (c) By the judge of the Shari’a District Court of Shari’a Circuit Court or any person designated by the judge, should the proper wali refuse without justifiable reason, to authorize the solemnization."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE II: Marriage and Divorce",
      "chapter": "CHAPTER II: Marriage (Nikah)",
      "section": "SECTION 1. Requisites of Marriage. –",
      "article_number": 19,
      "text": "Place of solemnization. – Marriage shall be solemnized publicly in any mosque, office of the Shari’a judge, office of the District or Circuit Registrar, residence of the bride or her wali, or at any other suitable place agreed upon by the parties."
    },
    {
      "book": "BOOK TWO: Persons and Family Relations",
      "title": "TITLE II: Marriage and Divorce",
      "chapter": "CHAPTER II: Marriage (Nikah)",
      "section": "SECTION 1. Requisites of Marriage. –",
      "article_number": 20,
      "text": "Specification of dower. – The amount or value of dower may be fixed by the contracting parties (marh-musamma) before, during, or after the celebration of the marriage. If the amount or the value thereof has not been so fixed, a proper dower (mahr-mithl) shall, upon petition of the wife, be determined by the court according to the social standing of the parties."
    }
  ]
}