{
  "articles": [
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE V: Penal Provisions",
      "chapter": "CHAPTER I: Rule of Bigamy",
      "section": "",
      "article_number": 180,
      "text": "Law applicable. – The provisions of the Revised Penal Code relative to the crime of bigamy shall not apply to a person married in accordance with the provisions of this Code or, before its effectivity, under Muslim law."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE V: Penal Provisions",
      "chapter": "CHAPTER II: Specific Offenses",
      "section": "",
      "article_number": 181,
      "text": "Illegal solemnization of marriage. – Any person who shall, without authority, solemnize any marriage purportedly under this Code, or shall do so in a manner contrary to the provisions thereof, shall be punished by imprisonment of not less than two months but not more than two years, or a fine of not less than two hundred pesos but not more than two thousand pesos, or both, in the discretion of the court."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE V: Penal Provisions",
      "chapter": "CHAPTER II: Specific Offenses",
      "section": "",
      "article_number": 182,
      "text": "Marriage before expiration of ‘idda. – Any widow or divorced woman who, having been married under Muslim law or under this code, contracts another marriage before the expiration of the prescribed ‘idda shall suffer the penalty of a fine not exceeding five hundred pesos."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE V: Penal Provisions",
      "chapter": "CHAPTER II: Specific Offenses",
      "section": "",
      "article_number": 183,
      "text": "Offenses relative to subsequent marriage, divorce, and revocation of divorce. – A person who fails to comply with the requirements of Articles 85, 161, and 162 of this Code shall be penalized by arresto mayor or a fine of not less than two hundred pesos but not more than two thousand pesos, or both, in the discretion of the court."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE V: Penal Provisions",
      "chapter": "CHAPTER II: Specific Offenses",
      "section": "",
      "article_number": 184,
      "text": "Failure to report for registration. – Except as provided in the article immediately preceding, a person who knowingly fails to perform his duty under this Code to report for registration any fact concerning the civil status of persons shall be punished by a fine of not less than one hundred pesos but not more than one thousand pesos."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE V: Penal Provisions",
      "chapter": "CHAPTER II: Specific Offenses",
      "section": "",
      "article_number": 185,
      "text": "Neglect of duty by registrars. – Any district registrar or circuit registrar who fails to perform properly his duties in accordance with this Code shall be penalized in accordance with Section 18 of Act 3753."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE VI: Transitory and Final Provisions",
      "chapter": "",
      "section": "",
      "article_number": 186,
      "text": "Effect of code on past acts. – (1) Acts executed prior to the effectivity of this Code shall be governed by the laws in force at the time of their execution, and nothing herein except as otherwise specifically provided, shall affect their validity or legality or operate to extinguish any right acquired or liability incurred thereby. (2) A marriage contracted by a Muslim male prior to the effectivity of this Code in accordance with non-Muslim law shall be considered as one contracted under Muslim law provided the spouses register their mutual desire to this effect."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE VI: Transitory and Final Provisions",
      "chapter": "",
      "section": "",
      "article_number": 187,
      "text": "Applicability Clause. – The Civil Code of the Philippines, the Rules of Court and other existing laws, insofar as they are not inconsistent with the provisions of this Code, shall be applied suppletorily."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE VI: Transitory and Final Provisions",
      "chapter": "",
      "section": "",
      "article_number": 188,
      "text": "Separability clause. – If, for any reason, any article or provision of this Code is held to be invalid, the same shall not affect the other articles or provisions hereof."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE VI: Transitory and Final Provisions",
      "chapter": "",
      "section": "",
      "article_number": 189,
      "text": "Repealing clause. – All laws, proclamations, executive orders, rules and regulations, or any part thereof, inconsistent with provisions of this Code are hereby correspondingly modified or repealed."
    },
    {
      "book": "BOOK FIVE: Miscellaneous and Transitory Provisions",
      "title": "TITLE VI: Transitory and Final Provisions",
      "chapter": "",
      "section": "",
      "article_number": 190,
      "text": "Effectivity. – This Code shall take effect immediately."
    }
  ]
}